---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSet.Erase(Autodesk.Revit.DB.Visual.Asset)
source: html/0dd06941-f25a-87fd-bf10-cdb2151b7b5f.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	Asset item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Visual.Asset`)